const ones = [
  "",
  "ένα",
  "δύο",
  "τρία",
  "τέσσερα",
  "πέντε",
  "έξι",
  "εφτά",
  "οκτώ",
  "εννιά",
] as const;

const teens = [
  "δέκα",
  "έντεκα",
  "δώδεκα",
  "δεκατρία",
  "δεκατέσσερα",
  "δεκαπέντε",
  "δεκαέξι",
  "δεκαεφτά",
  "δεκαοκτώ",
  "δεκαεννιά",
] as const;

const tens = [
  "",
  "δέκα",
  "είκοσι",
  "τριάντα",
  "σαράντα",
  "πενήντα",
  "εξήντα",
  "εβδομήντα",
  "ογδόντα",
  "ενενήντα",
] as const;

const hundreds = [
  "",
  "εκατό",
  "διακόσια",
  "τριακόσια",
  "τετρακόσια",
  "πεντακόσια",
  "εξακόσια",
  "εφτακόσια",
  "οκτασόσια",
  "εννιακόσια",
] as const;

const pluralOnes = [
  "",
  "ένα",
  "δύο",
  "τρεις",
  "τέσσερεις",
  "πέντε",
  "έξι",
  "εφτά",
  "οκτώ",
  "εννιά",
] as const;

const pluralTeens = [
  "δέκα",
  "έντεκα",
  "δώδεκα",
  "δεκατρείς",
  "δεκατέσσερείς",
  "δεκαπέντε",
  "δεκαέξι",
  "δεκαεφτά",
  "δεκαοκτώ",
  "δεκαεννιά",
] as const;

const pluralHundreds = [
  "",
  "εκατό",
  "διακόσιες",
  "τριακόσιες",
  "τετρακόσιες",
  "πεντακόσιες",
  "εξακόσιες",
  "εφτακόσιες",
  "οκτασόσιες",
  "εννιακόσιες",
] as const;

export { ones, teens, tens, hundreds, pluralOnes, pluralTeens, pluralHundreds };
